app/views/shared/_navbar.html.erb

          <%= link_to 'All', posts_path, class: 'dropdown-item' %>
          <% Category.all.each do |category| %>
---
SELECT "categories".* FROM "categories"