app/views/posts/_form.html.erb

SELECT "categories".* FROM "categories" ORDER BY "categories"."title" ASC
---

  <% @categories = Category.all.order(:title) %>