app/views/posts/show.html.erb

  <div class="col">
    <% if @post.user.avatar.blank? %>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]