app/controllers/categories_controller.rb

SELECT "categories".* FROM "categories"
---
  def index
    redirect_to index unless current_user.admin?
    @categories = Category.all.page(params[:page])

INSERT INTO "categories" ("title", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "Suspense"], ["description", "Categoria suspense"], ["created_at", "2019-04-16 14:16:33.879767"], ["updated_at", "2019-04-16 14:16:33.879767"]]
---
  def create
    @category = Category.new(category_params)

    respond_to do |format|
      if @category.save

SELECT  "categories".* FROM "categories" WHERE "categories"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def set_category
    @category = Category.find(params[:id])