app/controllers/posts_controller.rb

  def index
    @posts = Post.all.order('created_at desc').page(params[:page])
    if !params[:category].blank?
---
SELECT  "posts".* FROM "posts" ORDER BY created_at desc LIMIT $1 OFFSET $2  [["LIMIT", 1], ["OFFSET", 0]]
SELECT COUNT(*) FROM "posts"
SELECT "categories".* FROM "categories"

  def create
    @post = current_user.posts.build(post_params)

    respond_to do |format|
      if @post.save
---
INSERT INTO "posts" ("title", "description", "body", "created_at", "updated_at", "user_id", "slug") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["title", "Teste"], ["description", "teste2"], ["body", ""], ["created_at", "2019-04-22 16:17:58.873865"], ["updated_at", "2019-04-22 16:17:58.873865"], ["user_id", 3], ["slug", "teste"]]

  def set_post
    @post = Post.friendly.find(params[:id])
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]