app/controllers/posts_controller.rb

  def show
    @comments = Comment.where(post: @post)
---
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = $1  [["post_id", 3]]